Revit 2024 API
DocumentPreviewSettings Methods
The DocumentPreviewSettings type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
ForceViewUpdate
 Sets Revit to update the preview view if necessary.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsViewIdValidForPreview
 Identifies if the view id is valid as a preview view id.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
DocumentPreviewSettings Class
Autodesk.Revit.DB Namespace